cf/Enums/ВариантыОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВариантыОкругления/Ext/ManagerModule.bsl
Функция ПолучитьЧислоВариантаОкругления(Ссылка) Экспорт
	
	Если Ссылка = Перечисления.ВариантыОкругления.Окр0_01 Тогда
		
		Возврат 2;
			
	ИначеЕсли Ссылка = Перечисления.ВариантыОкругления.Окр0_1 Тогда
			
		Возврат 1;
			
	ИначеЕсли Ссылка = Перечисления.ВариантыОкругления.Окр1 Тогда
			
		Возврат 0;
		
	ИначеЕсли Ссылка = Перечисления.ВариантыОкругления.Окр10 Тогда
			
		Возврат -1;
		
	ИначеЕсли Ссылка = Перечисления.ВариантыОкругления.Окр100 Тогда
			
		Возврат -2;
				
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции
